bit-finance/DataProcessors/бит_ФормированиеПланируемыхПоступленийДСПоПервичнымДокументам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ФормированиеПланируемыхПоступленийДСПоПервичнымДокументам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроек</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПервичныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Comment>Организация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Comment>Документ</Comment>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Comment>Номер документа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Comment>Дата документа</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Контрагент</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сформирован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bit-finance/DataProcessors/бит_ФормированиеПланируемыхПоступленийДСПоПервичнымДокументам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция ИнициализироватьКомпоновщик(Компоновщик, ВыбранныеТипы, НастройкиКомпоновкиДанных) Экспорт
	
	СхемаКомпоновкиДанных = ПолучитьМакет("СхемаПодбора");

	ИзменитьСхемуКомпоновки(СхемаКомпоновкиДанных, ВыбранныеТипы);
		
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	
	Попытка
		Компоновщик.Инициализировать(ИсточникНастроек);	
	Исключение 
		ТекстСообщения = НСтр("ru='Невозможно применить настройки. По причине: %1';
							  |en='It is impossible to apply the settings. Due to: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		 
	КонецПопытки;
	
	Если НастройкиКомпоновкиДанных.Выбор.Элементы.Количество() = 0 Тогда
		Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе	
		НастройкиКомпоновкиДанных.Выбор.Элементы.Очистить();
		ШаблонКоллекции = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Выбор.Элементы;
		Коллекция		= НастройкиКомпоновкиДанных.Выбор.Элементы; 
		Для каждого Элемент Из ШаблонКоллекции Цикл
			НовоеПоле = Коллекция.Добавить(ТипЗнч(Элемент));
			ЗаполнитьЗначенияСвойств(НовоеПоле, Элемент);	
		КонецЦикла;
		Компоновщик.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
		Компоновщик.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	КонецЕсли;
	
	Возврат АдресСхемыКомпоновкиДанных;
	
КонецФункции

Функция ВыбранныеТипы(ТипыДокументов) Экспорт

	ВыбранныеТипы = Новый Массив;
	Для каждого СтрокаТаблицы Из ТипыДокументов Цикл
		Если СтрокаТаблицы.Пометка Тогда
			ВыбранныеТипы.Добавить(СтрокаТаблицы.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВыбранныеТипы;
	
КонецФункции

Процедура ЗаполнитьТипыДокументов(ТипыДокументов) Экспорт
	
	ТипыДокументов.Очистить();
	
	ТипыОбъектовДляЗаполнения = Метаданные.Документы.бит_кзн_ПозицияПоступления.Реквизиты.ДокументОснование.Тип.Типы();
	
	Для каждого Элемент Из ТипыОбъектовДляЗаполнения Цикл
				
		Если Метаданные.ОпределяемыеТипы.бит_ОбъектыБитФинанс.Тип.СодержитТип(Элемент) Тогда
			Продолжить;			
		КонецЕсли;
		
		МетаданныеОснования = Метаданные.НайтиПоТипу(Элемент);
		Если ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(МетаданныеОснования)
		   И ПравоДоступа("Чтение", МетаданныеОснования) Тогда
		   
			НоваяСтрока = ТипыДокументов.Добавить();
			НоваяСтрока.Пометка		  = Истина;
			НоваяСтрока.Значение	  = МетаданныеОснования.ПолноеИмя();
			НоваяСтрока.Представление = МетаданныеОснования.Представление();
		КонецЕсли;
	КонецЦикла;
	
	ТипыДокументов.СортироватьПоПредставлению();
	
КонецПроцедуры

Функция НовыеСохраняемыеНастройки() Экспорт 

	СохраняемыеНастройки = Новый Структура;
	СохраняемыеНастройки.Вставить("ВариантПериода", 		   ВариантСтандартногоПериода.ЭтотМесяц);
	СохраняемыеНастройки.Вставить("РежимЗаписи", 			   бит_ОбщегоНазначенияКлиентСервер.РежимыЗаписиДокументаСтрокой().Запись);
	СохраняемыеНастройки.Вставить("НастройкиКомпоновкиДанных", Новый НастройкиКомпоновкиДанных);
	СохраняемыеНастройки.Вставить("ВыбранныеТипы", 			   Новый Массив);
	СохраняемыеНастройки.Вставить("ЦФО");
	СохраняемыеНастройки.Вставить("СтатьяОборотов");
	
	Возврат СохраняемыеНастройки;

КонецФункции

Функция ПрименитьНастройки(НастройкаПодбораДокументов, ТипыДокументов, Обработка) Экспорт
	
	ШаблонНастроек = НовыеСохраняемыеНастройки();

	Если ЗначениеЗаполнено(НастройкаПодбораДокументов) Тогда
		
		РеквизитыНастройки 	 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаПодбораДокументов, "ХранилищеНастроек");
		СохраненныеНастройки = РеквизитыНастройки.ХранилищеНастроек.Получить();
		
		Если ТипЗнч(СохраненныеНастройки) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ШаблонНастроек, СохраненныеНастройки);
		КонецЕсли;  		
	КонецЕсли;
	
	ВыбранныеТипы = ШаблонНастроек.ВыбранныеТипы;
	Если ЗначениеЗаполнено(ВыбранныеТипы) Тогда
		ТипыДокументов.ЗаполнитьПометки(Ложь);
		Для каждого Элемент Из ВыбранныеТипы Цикл
			РезультатПоиска = ТипыДокументов.НайтиПоЗначению(Элемент);
			Если РезультатПоиска <> Неопределено Тогда
				РезультатПоиска.Пометка = Истина;				
			КонецЕсли;		
		КонецЦикла;
		ВыбранныеТипы = ВыбранныеТипы(ТипыДокументов);
	Иначе
		ВыбранныеТипы = ТипыДокументов.ВыгрузитьЗначения();	
	КонецЕсли;
		
	АдресСКД = ИнициализироватьКомпоновщик(Обработка.КомпоновщикНастроек, 
					ВыбранныеТипы, ШаблонНастроек.НастройкиКомпоновкиДанных);
							
	ЗаполнитьЗначенияСвойств(Обработка, ШаблонНастроек);
	
	Обработка.Период = Новый СтандартныйПериод(ШаблонНастроек.ВариантПериода);

	Возврат АдресСКД;
	
КонецФункции

Функция ЗаполнитьПереченьДокументов(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных) Экспорт

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных,,,
							Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ТаблицаПереченьПолный = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаПереченьПолный);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТаблицаПереченьПолный;
	
КонецФункции

Функция НовыеДокументыПланирования(ВыбранныеДокументы, Параметры) Экспорт

	ДобавленныеДокументы = Новый Соответствие; 
	
	ВыводитьОшибки         = Истина;
	ВыводитьИнформацию     = Истина;
	
	Если Параметры.РежимЗаписи = бит_ОбщегоНазначенияКлиентСервер.РежимыЗаписиДокументаСтрокой().Проведение Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	Иначе	
		РежимЗаписи = РежимЗаписиДокумента.Запись;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ВыбранныеДокументы Цикл 
		
		ДанныеЗаполнения = Новый Структура; 
		ДанныеЗаполнения.Вставить("ДокументОснование", СтрокаТаблицы.Документ);
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЦФО) Тогда
			ДанныеЗаполнения.Вставить("ЦФО", СтрокаТаблицы.ЦФО);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТаблицы.СтатьяОборотов) Тогда
			ДанныеЗаполнения.Вставить("СтатьяОборотов", СтрокаТаблицы.СтатьяОборотов);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТаблицы.ДатаПоступления) Тогда
			ДанныеЗаполнения.Вставить("ДатаПлан", СтрокаТаблицы.ДатаПоступления);
		КонецЕсли;
		
		ДокументОбъект = Документы.бит_кзн_ПозицияПоступления.СоздатьДокумент();
		ДокументОбъект.Заполнить(ДанныеЗаполнения);
		
		Попытка
			бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокументОбъект, РежимЗаписи, "", "Ошибки", Истина);
			ДобавленныеДокументы.Вставить(СтрокаТаблицы.Документ, ДокументОбъект.Ссылка);
		Исключение
			ТекстСообщения = НСтр("ru='Не удалось провести документ %1. По причине: %2';en='Failed to write the document. %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ДокументОбъект.Ссылка, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, СтрокаТаблицы.Документ); 
		КонецПопытки;
	КонецЦикла;

	Возврат ДобавленныеДокументы;
	
КонецФункции

Процедура ВыполнитьРегламентнуюОперацию() Экспорт

	ТипыДокументов = Новый СписокЗначений;
	
	ЗаполнитьТипыДокументов(ТипыДокументов);

	Обработка = Обработки.бит_ФормированиеПланируемыхПоступленийДСПоПервичнымДокументам.Создать();
	АдресСКД  = ПрименитьНастройки(Неопределено, ТипыДокументов, Обработка);

	СКД 					   = ПолучитьИзВременногоХранилища(АдресСКД);
	НастройкиКомпоновкиДанных  = Обработка.КомпоновщикНастроек.ПолучитьНастройки();
	
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "Период", Обработка.Период);

	// Заполним перечен документов.
	ТаблицаДокументов = ЗаполнитьПереченьДокументов(СКД, НастройкиКомпоновкиДанных);
	
	// Установим все флаги
	Если ТаблицаДокументов.Колонки.Найти("Пометка") = Неопределено Тогда
		ТаблицаДокументов.Колонки.Добавить("Пометка", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	ТаблицаДокументов.ЗаполнитьЗначения(Истина, "Пометка");
	
	Обработка.ПервичныеДокументы.Загрузить(ТаблицаДокументов);
	
	Параметры = НовыеСохраняемыеНастройки();
	ЗаполнитьЗначенияСвойств(Параметры, Обработка);
	
	НовыеДокументыПланирования(Обработка.ПервичныеДокументы, Параметры);

КонецПроцедуры

Процедура ИзменитьСхемуКомпоновки(СхемаКомпоновкиДанных, ВыбранныеТипы)
		
	ТипыДокументов = Новый СписокЗначений;
	ЗаполнитьТипыДокументов(ТипыДокументов);
	
	ЭлементыНабораДанных = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Элементы; 
	Для каждого Элемент Из ТипыДокументов Цикл
		Если ВыбранныеТипы.Найти(Элемент.Значение) = Неопределено Тогда
			МетаданныеДокумента = Метаданные.НайтиПоПолномуИмени(Элемент.Значение);
			Если МетаданныеДокумента <> Неопределено Тогда
				ИмяНабора 	= МетаданныеДокумента.Имя;
				НаборДанных = ЭлементыНабораДанных.Найти(ИмяНабора);
				Если НаборДанных <> Неопределено Тогда
					ЭлементыНабораДанных.Удалить(НаборДанных);		
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
